// Напишите программу которая принимает на вход число и выдает колличесво цифр в числе.

Console.Write("Введите число :");
string number = Convert.ToString(Console.ReadLine());
Console.WriteLine($"колличество символов в числе: {number.Length}");  

//Преобразовал число в строку и с помощью команды .Length показал колличесво символов в строке